{
  "education": [
    {
      "awards_achievements": [
        "Entrance Scholarship",
        "Dean's List (2019)",
        "GPA: 3.6/4.0"
      ],
      "degree": "Bachelor of Computing",
      "department": "School of Computer Science",
      "duration": "2016-2020",
      "school_name": "University of Guelph"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_DorjeeTenzin/",
  "highlighted_projects": [
    {
      "description": "Designed a modular system to parse through iCalendar (.ice) files using custom-built API and a LinkedList data structure in C. The backend server is built in NodeJS in conjunction with the parser library using FFI NodeJS module. Meanwhile, the Frontend web client is written in pure JavaScript/HTML.",
      "git_url": "https://github.com/chopgye/ics-calendar-parser",
      "name": "iCalendar Web App with Parser"
    },
    {
      "description": "This app utilizes a MVC framework with Server Side Rendering and is written purely in Django for most apart with an exception of few JQuery and AJAX calls. Implemented functionalities similar to Reddit which allows for users to comment, upvote, downvote, and favorite user posts. It utilizes generic relations and class-based views to ensure scalability and allow for inheritance. In addition, it's completely containerized using Docker and Deployed to Heroku through Container Registry.",
      "git_url": "https://github.com/chopgye/blog-django",
      "name": "Blog Style Reddit Clone"
    },
    {
      "description": "Designed and implemented a fully functional authentication system using JSON Web Tokens. It utilizes React and TypeScript on the frontend and GraphQL to query the backend API on Apollo server with PostgresSQL database. In terms of design choices, the Access Token is stored in-memory instead of the traditional local storage or cookie-based storage to further limit XSS and CRSF attacks, meanwhile, the refresh token is stored as a cookie.",
      "git_url": "https://github.com/chopgye/jwt-auth",
      "name": "JSON Web Token (JWT) Authentication System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed an MVP tool using bash monitoring agent to record hardware specifications and monitor resources usage for a Linux Cluster Administration team in real-time. The Cluster consists of a switch that connects multiple nodes/servers running CentOS 7 provisioned by Google Cloud Platform (GCP). The Cluster utilizes bash scripts to initialize a PostgresSQL Docker instance, create a schema, retrieve data from the nodes, and populate the database. Relevant data is isolated and filtered using SQL queries to generate meaningful reports. Version control is achieved through git for the local repository and GitHub for the remote repository with Gitflow conventions.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": [
        "Twitter CRUD App: In Progress...",
        "JDBC App: In Progress...",
        "Grep App: In Progress..."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Dorjee Tenzin",
  "others": [
    {
      "bullets": [
        "Sports (Basketball, Badminton and Table Tennis)",
        "Hiking",
        "Gardening"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed and implemented various software projects and server-side applications following Agile and Scrum project development methodology. Gained hands-on industry-standard development experience with Linux, SQL, Java and GCP. Participated in every stage of the project lifecycle management including deployment using enterprise standards such as Docker and GitFlow.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "University of Guelph",
      "description": "Helped foster an open environment for students to ask questions and voice concerns regarding the coursework. Conducted labs, reviews, assessments, and proctor in coordination with the instructor and head TA.",
      "duration": "2019",
      "title": "Teaching Assistant(TA)"
    }
  ],
  "skills": {
    "competent": [
      "Javascript/React",
      "NodeJS/Express",
      "Docker",
      "AWS/GCP",
      "CSS"
    ],
    "familiar": [
      "GraphQL",
      "Springboot",
      "TypeORM",
      "TypeScript",
      "Heroku"
    ],
    "proficient": [
      "Java",
      "Python/Django",
      "C",
      "RDBMS/SQL/Postgres",
      "Agile/Scrum",
      "REST"
    ]
  },
  "summary": "I have a Bachelor of Computing from the University of Guelph, where I majored in Computer Science. Throughout my education, I gained a solid fundamental understanding of computer science concepts and paradigms which allow me to be adaptable in the face of new technologies. I’m great at problem-solving and enjoy writing clean and robust code more than ever, and I love learning new concepts, technologies, and methodologies and applying that knowledge and myself. This passion has led me to explore and familiarize myself with much modern application and web development frameworks. \n\nI like to keep a healthy balance of passion and pragmatism in terms of mentality and outlook on workplace culture. While I enjoy learning new things and writing beautiful, elegant code, I am mindful of time and business constraints within a larger collaborative environment. I have many experiences working and collaborating with a team to complete a project. During University, I was a Teaching Assistance (TA) for The Analysis and Design of Computer Algorithms course in which I had to mentor Second Year students in collaboration with other TA’s and the professor. At my current occupation at Jarvis Consulting, I work in a team to complete projects using Agile and Scrum methodologies. My strong academic background and experience working and collaborating within a team will allow me to make meaningful contributions and be a great addition to your team."
}
